{
  "General Information": "\nT.I.P. General Information: The Technological Institute of the Philippines (T.I.P.) was established on February 8, 1962, \nby Engineer Demetrio A. Quirino, Jr. and Dr. Teresita U. Quirino as a private non-sectarian stock school in Manila.\n\nVision: We envision a better life for Filipinos by empowering our students with the best globally competitive technological \neducation in engineering, computing, and allied disciplines.\n\nMission: Through digitalization and innovation in academic design and delivery, T.I.P. students, faculty, staff and industry \npartners work together in both traditional and online/flexible learning to transform our students to achieve optimal students outcomes.\n\nCore Values: Commitment to Continuous Improvement and Innovation, Collaborative Mindset, Community Spirit, Service Orientedness, \nPositive Attitude for Learning and Working, Effective and Open Communication, Digitally Savvy.\n\nGraduate Attributes: Professional Competence, Communication Skills, Critical Thinking and Problem Solving Skills, \nSocial and Ethical Responsibility, Interpersonal Skills, Productivity, Lifelong Learning.\n\nProgram Offerings include Engineering and Architecture (BSArch, BSChE, BSCE, BSCpE, BSEE, BSECE, BSEnSE, BSIE, BSME), \nComputer Studies (BSCS, BSDSA, BSIT, BSIS, BSEMC), Business Education (BSA, BSAIS, BSBA), Teacher Education (BSEd, BSNEd, TCP), \nand Arts programs.\n\nAwards and Recognitions: T.I.P. Manila and T.I.P. Quezon City were awarded Autonomous Status by CHED in April 2016. \nThe institution has ABET accreditation, Seoul Accord recognition, and AUN-QA assessment for select programs.\n",
  "Admissions": "\nStudent Eligibility for Admissions: Students who satisfy any of the following may apply for admission to T.I.P.: \n1) Graduates of secondary education recognized by DepEd and not enrolled in any tertiary program, \n2) Passers of PEPT or ALS following DepEd regulations, 3) College Transferees, 4) Second Degree Applicants, 5) Cross-Enrollees.\n\nAdmission Requirements for First Year Filipino Students: Original copy of Senior High School Report Card (Form 138/SF9) from Grade 12, \nOriginal copy of PSA Birth Certificate, Certificate of Good Moral Character (with school seal), Two 2\"x2\" recent ID pictures, \nCertificate of Honors/Rank if applicable, Mandatory drug test.\n\nFor Transferees/Second Degree Applicants: Original copy of Transfer Credentials, Transcript of Records or True Copy of Grades \nfrom last school attended, Certificate of Good Moral Character, Two 2\"x2\" recent ID pictures, Mandatory drug test.\n\nFor International Students: A separate set of guidelines shall apply for admission of international students.\n\nEnrollment Procedure: A student applicant who has complied with all admission requirements is qualified to enroll. \nIf requirements (except Form 138/SF9/Transfer Credential/ALS/PEPT result) are not available, the applicant must execute \nan UNDERTAKING and comply within the term of first enrollment.\n",
  "Registration and Enrollment": "\nEnrollment Procedure and Regulations: A student shall be considered officially enrolled if one has submitted all required \nadmission credentials and has paid in full, or made arrangement to pay the tuition and other fees for the semester on installment basis.\n\nCourse Load: The course load and sequence of courses shall be in accordance with the approved curriculum for each program of study. \nNo course may be taken unless the prerequisite courses have been taken and passed. Otherwise, the registration shall be invalidated.\n\nFor Engineering and Computing programs, the Design/Capstone Course shall be enrolled ONLY in the terminal/last term of the student.\n\nA grade of 5.00 (Failed) in any prerequisite course disqualifies a student from enrolling in the next-higher course.\n\nCancellation of Enrollment/Withdrawal: A student who wishes to withdraw studies before start of classes or within first two weeks \nmust notify the Registrar in writing through the Program Chair/College Dean, and copy furnish Student Accounting Services.\n\nProgram Shifting: A student shall be allowed to shift to another program provided one complies with program residency requirement \nof one (1) school year attendance in T.I.P. or at least forty-two (42) units. Program shifting may be allowed only once.\n\nCross Enrollment: Cross-enrollment is only permitted if the total study load does not exceed the regular study load for the semester. \nT.I.P. students are not allowed to cross-enroll in more than one (1) school in a semester.\n",
  "Grading System": "\nGrading System: There are three major examinations to complete a course: prelim, midterm, and final exams.\n\nGrade Scale: 1.00 (94-100) Excellent, 1.25 (88.5-93.99) Superior, 1.50 (83-88.49) Meritorious, 1.75 (77.5-82.99) Very Good, \n2.00 (72-77.49) Good, 2.25 (66.5-71.99) Very Satisfactory, 2.50 (61-66.49) Satisfactory, 2.75 (55.5-60.99) Fair, \n3.00 (50-55.49) Passing, 5.00 (0-49.99) Failed, 4.00 Incomplete, 6.00 Official Dropped, 7.00 Unofficially Dropped, \n8.00 No Credit, 9.00 Withdrawn.\n\nGrade Computation Formulas:\nPG = 0.50 PE + 0.50 CSP (Prelim Grade)\nMG = 1/3 PG + 2/3 (0.50 ME + 0.50 CSM) (Midterm Grade)\nFG = 1/3 MG + 2/3 (0.50 FE + 0.50 CSF) (Final Grade)\n\nWhere PE = Prelim Exam, ME = Midterm Exam, FE = Final Exam, CS = Class Standing\n\nA grade of 4.0 (Incomplete): Failure to remove within one-year prescribed period shall automatically result in grade of 5.0 (Failed). \nThe student is required to re-enroll in the course.\n\nA grade of \"NC\" or No Credit shall be given to a student who did not take the final examination or did not submit an academic \nrequirement for completion of a course and the student's scholastic performance is not sufficient to merit a passing grade.\n",
  "Academic Probation and Retention": "\nStudent Retention: A full-time student who failed in more than 50% of one's registered units, including PE and CWTS, \nshall be placed on academic probation. The school shall allow three (3) probationary terms for the duration of student's program of study.\n\nFor students on academic probation in programs NOT requiring licensure examination: allowed to re-enroll on reduced load - \nFirst Probation: 3 units less from previous semester or 9 units (whichever higher); \nSecond Probation: Same as first probation; Third Probation: Same rules apply.\n\nFor students on academic probation in programs REQUIRING licensure examination: \nFirst Probation: 3 units less from previous semester or 9 units (whichever higher); \nSecond Probation: 3 units less from previous semester or 9 units (whichever higher) AND/OR student shall be advised \nto shift to program not requiring board examination; Third Probation: Similar restrictions.\n\nA student under Third Probation status who fails in one course shall no longer be readmitted in succeeding term.\n\nFor transferees: A transferee shall be placed under Academic Probation if one has failed and/or dropped more than 50% \nof units enrolled during previous semester. The transferee shall enroll on reduced load of eighteen (18) units and \nattend regular counseling session during the semester.\n",
  "Graduation Requirements": "\nGraduation: A student who has successfully completed all courses in one's curriculum, complied with all graduation requirements, \nand fulfilled residency requirement of at least one (1) school year attendance in T.I.P. or at least forty-two (42) units is \neligible for graduation.\n\nDeemed ineligible for graduation: student with pending grade/s of 4.00 (Incomplete); 5.00 (Failed); 6.00 (Officially Dropped); \n7.0 (Unofficially Dropped); unsettled financial and property obligations with the school; unresolved disciplinary cases; \npenalty of exclusion/expulsion.\n\nGraduation Honors - Latin Honors awarded only to graduating students with four and/or five-year degree program:\n- Summa Cum Laude: GPA 1.00 to 1.25 with no grade in any course below 1.50\n- Magna Cum Laude: GPA 1.26 to 1.50 with no grade in any course below 2.00\n- Cum Laude: GPA 1.51 to 1.75 with no grade in any course below 2.50\n\nTo qualify for Latin Honors, graduating student must have earned at least 75% of required courses of the program at T.I.P. \nNon-academic grades (e.g., NSTP) are not included in GPA computation for Latin Honor.\n\n\"With Distinction\" award given to graduating student who may satisfy GPA requirement for Latin Honor but obtains low grades \n(below 2.5) in any course, including PE and NSTP.\n\nAny violation of school rules and regulations punishable with suspension shall constitute grounds for disqualification from \nreceiving any and all academic honors from T.I.P.\n",
  "Scholarships and Financial Aid": "\nScholarships: T.I.P. is committed to bring the opportunity of higher education to students who earnestly desire it and \ndemonstrate the ability to benefit from it. The school offers various scholarship programs.\n\nMajor scholarship grants: \n1) Engr. Demetrio A. Quirino Jr. Scholarships for Engineering and Architecture\n2) Dr. Teresita U. Quirino Scholarships for Accountancy and Teacher Education\n\nScholarship Monitoring: For scholars, a scholarship coordinator is tasked to monitor their performance regularly and help them \naddress academic difficulties. Orientation of new scholars is conducted to facilitate immersion and mentoring. \nParticipation of scholars in exchange programs and competitions inside and outside the school is encouraged.\n\nThe scholarship coordinator facilitates the organization and operation of the scholars' association to promote their welfare.\n",
  "Student Conduct and Discipline": "\nNorms of Conduct for Students: All students are obliged to read announcements on Canvas LMS, website, official T.I.P. social media accounts, \nand bulletin boards to keep abreast of T.I.P. activities. Students have rights to express concerns, be represented through Student Council, \nform organizations, and defend oneself against charges.\n\nID Card Policy: For proper identification, student must wear ID card upon entering campus. No ID, no entry. \nAnyone caught without ID while inside campus shall be subject to disciplinary sanctions.\n\nAttire and Grooming: The approved school uniform for male and female students shall be worn inside campus during school days \nexcept non-school uniform day/s. For online classes, dress code prescribed in T.I.P. Policy on Student Protocols and Etiquette \nfor Online Learning shall be observed.\n\nFor male students NOT allowed: long hair (should be tidy, combed, properly trimmed), hair accessories, multi-colored/loud hair coloring, \ncolored nail polish, ear/nose/tongue/other visible piercings, visible tattoos, shorts, sandals/slippers, caps/hats, scarves.\n\nFor female students NOT allowed: more than one earring per ear, ear/nose/tongue/other visible piercings, visible tattoos, \nmulti-colored/loud hair coloring.\n\nClassroom Behavior: Student should abide by usual classroom policies and procedures implemented by teachers, both in-person and virtual. \nTeacher responsible to report to OSA any student violating these policies.\n\n5S Japanese Model: Every student expected to observe proper norms of politeness, etiquette, and courtesy. \n5S represents: Seiri (Sort/Suriin), Seiton (Systemize/Sinupin), Seiso (Sweep/Simutin), Seiketsu (Sanitize/Siguruhin ang Kallinisan), \nShitsuke (Self-discipline/Sariling Kusa).\n\nDecorum: Faculty members, administrators, or staff have special parental authority (loco parentis) for students. \nThey are obligated to call attention of students who display unbecoming behavior inside or outside campus.\n",
  "Student Organizations": "\nStudent Organizations: Membership in any recognized student organization is voluntary. However, recruitment of first-year students \nto fraternities/sororities is strictly prohibited. Students should immediately report incidents of forced recruitment and other \nfraternity-related cases such as hazing, threat, intimidation, coercion, extortion to SOHAS, GCC, or OSA.\n\nUse of Campus Facilities: School allows students to use campus facilities (PE Center, Big Court, Seminar Rooms, Congregating Area, \nStudy Areas) for programs, meetings, recreational and educational activities. School has right to deny use of facilities to those \nunable or unwilling to abide by school rules and regulations.\n\nRepresentation: Student may not participate in any outside activity, contest, conference, field trip, association, society, or group \nas representative of school or any recognized student organizations without written authorization from OSA, VPSAS, VPAA, or T.I.P. President.\n\nSchool shall not be held responsible for consequences resulting from student's/student organization's participation in outside activity \ndone in individual's/organization's personal capacity without school's prior written approval.\n\nAnnouncements and Publications: Student must obtain clearance from OSA before posting school-related materials/announcements. \nMaterials carrying school's name, logo, identification (print or digital, inside/outside campus) must be submitted for vetting \nto both OSA and Marketing and Communications Office (MCO). This applies to announcements in newspapers/magazines, posters, \nstreamers in public spaces, and social media profiles of student councils and recognized organizations.\n",
  "Attendance Policy": "\nAttendance: Prompt and regular attendance in all classes required of all students from very first meeting of every course.\n\nStudent who incurs absences of more than twenty (20%) percent of prescribed number of class or laboratory periods during term \nshall not earn credit for the course.\n\nStudent considered officially enrolled only if: submitted appropriate admission/transfer credentials; paid school fees (down payment) \nupon enrollment; been authorized to attend classes by school.\n\nExcuse Letters: In case of absence, student must present letter of excuse to all teachers concerned. If student is minor or \neven if turned 18 but still wholly dependent upon parents for support, letter must be signed by parent or guardian.\n\nMedical Absences: In case of absence due to illness, excuse letter or medical certificate must be validated by Medical and Dental Services (MDS).\n\nStudent held responsible for all lessons and assignments missed during absence.\n\nApproved Absence: applies to student authorized in writing by OSA or other school officials to represent T.I.P. in off-campus \nfunction/activity or attend meeting with school officials.\n\nTardiness Policy: Student considered late/tardy if arrival in class within: 1-hour period - 15 minutes; 1.5-hour period - 25 minutes; \n2-hour period - 30 minutes; 3-hour period - 45 minutes. Student tardy three (3) times considered as absent for one (1) meeting.\n\nDropped Status: Student who stopped attending classes and/or incurred absences equivalent to more than 20% of school days \nwith or without notification shall not be given credit. Marks: \"6.00\" if 20% limit exceeded before Midterm with notification; \n\"7.00\" if exceeded without notification; \"5.00\" if exceeded after Midterm with failing Midterm Grade.\n",
  "Student Services": "\nStudent Services Available at T.I.P.:\n\n1. Career Services: Career Centers provide high-quality services to support students at all stages including career training, \ndevelopment, advising, and services helping students realize value of their degree.\n\n2. Library: Practices combination of open and semi-closed shelf systems. Services include: Orientation and Instruction, \nReference and Information, Internet Services, OPAC, Bibliographic Services, Current Awareness, Instructional Media, \nPhotocopying and Printing, Inter-referral, Wi-fi. Also provides Virtual Reference Assistance, Online Document Delivery, \nOnline Bibliographic Service, Online Library Orientation, Online Learning Resources.\n\n3. Medical and Dental Services (MDS): Clinic provides consultations, treatment for common medical/dental illnesses, \nbasic first aid treatment. Laboratory workups and special diagnostic procedures issued as necessary. Dental services include \noral examination, oral prophylaxis, temporary filling, common dental treatments and emergencies. Online Medical/Dental Consultation \nintegrated into Student Well Being Program (SWBP) accessible via T.I.P. Canvas LMS.\n\n4. Office of Student Affairs (OSA): Committed to encourage students to experience meaningful and excellent academic life in \nsafe and harmonious environment. Three main services: Student Leadership Development, Student Discipline, and Institutional Student Support Programs.\n\n5. Guidance and Counseling Center (GCC): Provides variety of services responsive to needs of individual students or special groups. \nOffers: Counseling Service, Information Service, Individual Inventory, Testing Service, and Referral Service.\n\n6. Math Enhancement Program (MEP): Free Summer Math Tutorial for incoming Engineering, Architecture, and IT first-year students \nto prepare them to take college-level math courses. Special intervention program in Mathematics designed to identify special learning needs.\n\n7. Online Study Group Tutorial (OSGT): Free tutorial in Mathematics and English for students who need extra help. \nObjectives: clarification of earlier lessons; reinforce key concepts; serve as advanced coursework; serve as review for board examinations. \nSessions facilitated by faculty members and pre-selected students as peer tutors/teaching assistants.\n\n8. Student Advising: Advising system provides individual advice and assistance in completion of program of study. \nGuides students about academic policies, career options, instructional support, job opportunities. Curriculum advising involves \nassisting students in selecting courses each term. Career advising covers employment opportunities, clarifications about sub-fields, \npossibilities of graduate studies, career-related concerns.\n\n9. Security, Occupational Health, and Safety Office (SOHAS): Security and safety is primary concern. Friendly and reliable security guards \nroaming campus as scheduled. Adequate CCTV cameras installed for surveillance. Strong partnership with policemen and barangay personnel. \nGuided by Emergency Management Manual with response protocols and countermeasures to various emergencies.\n\n10. T.I.P. EXCEL: Student success program aims to prepare T.I.Pians to accomplish current and future academic, personal, \nand professional goals through value-adding programs. Integrates: T.I.P. LEADS (alternative-design systems), T.I.P. ENGAGE \n(high student retention), T.I.P. Student Well-being Program (online services), T.I.P. CONNECT (student concerns).\n",
  "Tuition and Fees": "\nPayment of Tuition and Other School Fees: Tuition and other school fees shall be payable in cash or installment payments \nin accordance with schedule provided by Student Accounting Services.\n\nNotice of any increase in fees shall be announced in advance through posting on bulletin boards in conspicuous places in school premises.\n\nUpon enrollment, student and/or parent/s/guardian/s bind themselves to pay corresponding tuition and other school fees whether \nstudent completes or does not complete studies during given semester.\n\nStudent and parent/s/guardian/s agree they are bound to recognize policy that student shall be readmitted only if tuition and \nother school fees are paid in full.\n\nRefund Policy: Student who files for cancellation/withdrawal/discontinuance of studies within first two (2) weeks of classes \nduring regular semester or within first four (4) days of classes during summer and has paid pertinent fees may apply for refund:\n\n- Administrative/processing fee if one withdraws before start of classes\n- Ten percent (10%) of total amount due if withdraws within first week of classes in regular semester or within two (2) days in summer\n- Twenty percent (20%) of total amount due if withdraws within second week of classes in regular semester or on third/fourth day in summer\n- Full fees due for term if withdraws any time after second week of classes in regular semester or after fourth day of classes in summer\n\nProcessing is one (1) month after start of classes. Follow-ups for refunds may be done only a month after start of classes.\n\nUndersized Classes: Full class defined as class consisting of fifteen (15) or more students. Undersized class has fewer than fifteen (15) students.\n\nClass of 6-14 students may be retained if: students pay for shortfall (difference between what 15-student class would have paid and \nwhat undersized class actually paid); OR assigned faculty member requests authority to handle class at modified rate (80% of faculty rate \nor 80% of tuition paid by undersized class, whichever lower).\n\nClass of 5 students or less may be retained if students shoulder shortfall. Otherwise, class shall be dissolved.\n",
  "Disciplinary Offenses": "\nClassification of Offenses and Sanctions:\n\nMinor Offenses include:\n1. Failure to abide with health and safety protocols\n2. Non-wearing of school ID card\n3. Tampered/unvalidated school ID card\n4. Improper haircut/style, improper hair dye color\n5. Improper or non-wearing of school uniform\n6. Non-observance of dress code\n7. Wearing inappropriate jewelry/accessories\n8. Cross-dressing\n9. Refusal to submit to lawful inspection/search\n10. Failure to return library books on time\n11. Lost/damaged library books\n12. Use of mobile phones during class hours\n13. Unauthorized posting of announcements\n14. Running, shouting, whistling\n15. Sitting on armchairs/tables causing damage\n16. Littering or spitting\n17. Loitering in corridors\n18. Chewing gum\n19. Hiding valuable property of others\n20. Public display of affection\n\nMajor Offenses - Academic Dishonesty:\n1. Forgery or falsification and/or alteration or misrepresentation of academic/official school records or school-related documents\n2. All forms of cheating in any examination, test, quiz, project, report, or assignment\n3. Academic dishonesty such as plagiarism; passing off someone else's work as one's own\n\nGeneral Rules of Conduct and Discipline: All cases involving discipline of students shall be subjected to jurisdiction of \nOffice of Student Affairs (OSA). OSA shall conduct investigation, act upon minor offenses, issue preventive suspension orders \npending investigation when necessary, and for major offenses recommend to President creation of investigating committee.\n\nFor violations that are criminal in nature, school reserves right to turn over student to police authorities. \nAdministrative charges may also be filed without prejudice to existing penal laws.\n",
  "Educational Philosophy": "\nT.I.P.'s Educational Philosophy: T.I.P. believes that when students are immersed in constructivist experiential technological \nteaching and learning focused on outcomes, and imbued with grit, determination and love for fellow Filipino, they become lifelong learners, \ninnovators, and problem-solvers for the nation.\n\nOpen-Door Policy: T.I.P. is committed to bring opportunity of higher education to students who earnestly desire it and demonstrate \nability to benefit from it. Consistent with philosophy of making higher education accessible to many, T.I.P. offers various scholarship programs.\n\nOutcomes-Based Education (OBE): In continuing quest for excellence and spirit of continuous quality improvement, T.I.P. implemented \nOutcomes-Based Education as strategy to achieve long-term objectives for graduates. OBE is working backward with students as center \nof learning-teaching milieu.\n\nImplementation driven by: 1) regulatory bodies (CHED, PRC, IMO); 2) local and international accrediting bodies (PACUCOA, PTC-ACBET-EAC, ABET); \n3) international certifying bodies; 4) feedback from external stakeholders.\n\nGuided by internal policies: 1) Vision, Mission, Core Values, Core Competencies; 2) Quality Policy; 3) T.I.P. initiatives supporting OBE \n(Faculty and Staff Development Program, Student Development Program).\n\nOutcomes-Based Teaching and Learning (OBTL): T.I.P. embarked on proactive plan to implement OBTL in all academic programs using \nCity University of Hong Kong OBTL model. Framework revolves around: 1) Intended Learning Outcomes (ILOs), 2) Teaching and Learning Activities (TLAs), \n3) Assessment Tasks (ATs).\n\nOBTL is student-centered approach to delivery of educational programs where curriculum topics expressed as intended outcomes for students to learn. \nTeachers facilitate, students actively engaged in learning process. About re-aligning intended learning outcomes with teaching and assessment, \nfocusing on what graduates know, what they can do, and their personal attributes.\n\nStudent Development Program (SDP): Aims to produce graduates with full competence in fields of study and possess Filipino industry-desired \nand global citizen values to enhance employability and desirability by industry after graduation. SDP mainstreamed in identified courses. \nConsists of modules: Self-Awareness, Goal Setting, Values Development, Developing Winner's Mindset. SDP serves as vehicle of OBTL addressing \nspecific components of program educational objectives and student outcomes.\n"
}